docs: updated doc
